---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.MassSurfaceData
source: html/604a0d68-9b18-59c3-ee68-53710f79ac69.htm
---
# MassSurfaceData Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.